Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: .WillOnce(WithArgs<0, 2, 3>(Invoke(IsVisibleInQuadrant1))); // No need to define your own adaptor.
it_it: .WillOnce(WithArgs<0, 2, 3>(Invoke(IsVisibleInQuadrant1))); // Non è necessario definire il proprio adaptor.

source: .WillOnce(action) // Can be used any number of times
it_it: .WillOnce(action) // Può essere utilizzato un numero qualsiasi di volte

source: .WillOnce(action) // Can be used at most once
it_it: .WillOnce(action) // Può essere utilizzato al massimo una volta

source: .WillRepeatedly(Return("John Doe")); // Return "John Doe" on all calls EXPECT_CALL(my_mock, GetNumber())
it_it: .WillRepeatedly(Return("John Doe")); // Restituisce "John Doe" per tutte le chiamate EXPECT_CALL(my_mock, GetNumber())

source: .WillRepeatedly(Return(7)); // Return 7 on all subsequent calls
it_it: .WillRepeatedly(Return(7)); // Restituisce 7 a tutte le chiamate successive

source: .WillRepeatedly(Return(std::ref(x))); // Wrong!
it_it: .WillRepeatedly(Return(std::ref(x))); // Sbagliato!

source: .WillRepeatedly(ReturnPointee(&x)); // Note the & here.
it_it: .WillRepeatedly(ReturnPointee(&x)); // Notare qui la &.

source: .WillRepeatedly(action) // Can be used any number of times
it_it: .WillRepeatedly(action) // Può essere utilizzato un numero qualsiasi di volte

source: .WillRepeatedly(action) // Can be used at most once
it_it: .WillRepeatedly(action) // Può essere utilizzato al massimo una volta

source: .With(multi_argument_matcher) // Can be used at most once
it_it: .With(multi_argument_matcher) // Può essere utilizzato al massimo una volta

source: // goes out of scope and is destroyed.
it_it: // uscirà dallo scope e verrà distrutto.

source: // - value_ is leaked.
it_it: // - value_ viene perso [leak].

source: // ... other default actions ...
it_it: // ... altre azioni di default ...

source: // ... other expectations ...
it_it: // ... altre expectation ...

source: // 2 the second time.
it_it: // 2 la seconda volta.

source: // A death test can be a simple function call.
it_it: // Un death test può essere una semplice chiamata di funzione.

source: // A simple packet stream class.
it_it: // Una semplice classe per lo stream di pacchetti [packet].

source: // Aborts if Subroutine() had a fatal failure.
it_it: // Abortisce se Subroutine() ha avuto un errore fatale.

source: // Add the following two lines to the mock class.
it_it: // Si aggiungono le seguenti due righe alla classe mock.

source: // Adds a listener to the end.
it_it: // Aggiunge un listener alla fine.

source: // All of these optional, just like in regular macro usage.
it_it: // Tutto questo è opzionale, proprio come nell'utilizzo delle normali macro.

source: // An action that contains move-only types and has an &&-qualified operator, // demanding in the type system that it be called at most once.
it_it: // Una action che contiene tipi move-only e ha un operatore qualificato &&, // esige nel [type system] che sia chiamata al massimo una volta.

source: // Another solution - use type aliases:
it_it: // Un'altra soluzione: utilizzare gli alias dei tipi:

source: // Bar() must be called with an even number.
it_it: // Bar() deve essere chiamato con un numero pari.

source: // Bar(4) dies.
it_it: // Bar(4) 'muoia'.

source: // By default, all calls are delegated to the real object.
it_it: // Per default, tutte le chiamate sono delegate all'oggetto reale.

source: // C++'s look-up rules rely on that.
it_it: // Le regole di ricerca del C++ si basano su questo.

source: // Call() and has type F.
it_it: // Call() e ha il tipo F.

source: // Called after a failed assertion or a SUCCESS().
it_it: // Chiamato dopo un'asserzione fallita oun SUCCESS().

source: // Called after a test ends.
it_it: // Chiamato dopo la fine di un test.

source: // Called after the last test in this test suite.
it_it: // Chiamata dopo l'ultimo test in questa test suite.

source: // Called before a test starts.
it_it: // Chiamato prima dell'inizio del test.

source: // Called before the first test in this test suite.
it_it: // Chiamata prima del primo test in questa test suite.

source: // Can be omitted if not needed.
it_it: // Può essere omessa se non necessaria.

source: // Can use info.param here to generate the test suffix
it_it: // Può utilizzare info.param per generare il suffisso del test

source: // Class MockFunction<F> has exactly one mock method.
it_it: // La classe MockFunction<F> ha esattamente un metodo mock.

source: // Class members declared here can be used by all tests in the test suite
it_it: // I membri della classe dichiarati qui possono essere utilizzati da tutti i test nella test suite

source: // Code here will be called immediately after each test (right
it_it: // Il codice qui verrà chiamato immediatamente dopo ogni test (subito

source: // Code here will be called immediately after the constructor (right
it_it: // Il codice qui verrà chiamato immediatamente dopo il costruttore (subito

source: // Define the test suite and tests.
it_it: // Definisce la test suite e i test.

source: // Defines a base test fixture.
it_it: // Definisce una fixture base.

source: // Delegate to the given method whenever the factory is invoked.
it_it: // Delega al metodo specificato ogni volta che viene invocata la factory.

source: // Delegates the default actions of the methods to a FakeFoo object.
it_it: // Delegates le azioni di default dei metodi a un oggetto di FakeFoo.

source: // DescribeNegationTo(), like the following.
it_it: // DescribeNegationTo(), come il seguente.

source: // Describes self to an ostream.
it_it: // Descrive sé stesso [self] a un ostream.

source: // Describes the negation of this matcher to an ostream.
it_it: // Descrive la negazione di questo matcher a un ostream.

source: // Describes the property of a value NOT matching this matcher.
it_it: // Descrive la proprietà di un valore che NON corrisponde a questo matcher.

source: // Describes the property of a value matching this matcher.
it_it: // Descrive la proprietà di un valore che corrisponde a questo matcher.

source: // Describes this matcher to an ostream.
it_it: // Descrive questo matcher a un ostream.

source: // Do NOT delete the returned object - it's managed by the UnitTest class.
it_it: // NON eseguire il delete sull'oggetto restituito: è gestito dalla classe UnitTest.

source: // DoThat() receives.
it_it: // DoThat() riceve.

source: // DuplicateArg<k, T>(output) converts the k-th argument of the mock // function to type T and copies it to *output.
it_it: // DuplicateArg<k, T>(output) converte il k-esimo argomento della funzione mock // nel tipo T e lo copia in *output.

source: // ElementsAreArray accepts an array of element values.
it_it: // ElementsAreArray accetta un array di elementi valori.

source: // Exercises the Xyz feature of Foo.
it_it: // Esegue la funzionalità Xyz di Foo.

source: // Expect equality.
it_it: // Si aspetta l'uguaglianza.

source: // Expect foo.Bar( ... ) twice with any arguments.
it_it: // Si aspetta foo.Bar( ... ) due volte con qualsiasi argomento.

source: // Expect two strings not to be equal.
it_it: // Si aspetta che le due stringhe non siano uguali.

source: // Expects *foo to die after bar->A() and before bar->B().
it_it: // Si aspetta che *foo muoia dopo bar->A() e prima di bar->B().

source: // Expects that Foo()'s argument < bar.
it_it: // Si aspetta che l'argomento di Foo() < bar.

source: // Expects that Foo()'s argument == bar.
it_it: // Si aspetta che l'argomento di Foo() == bar.

source: // Expects the turtle to move forward by 100 units.
it_it: // Si aspetta che la tartaruga si muova in avanti di 100 unità.

source: // Expects the turtle to move forward.
it_it: // Si aspetta che la tartaruga vada avanti.

source: // F, and ArgumentTuple is the tuple of arguments of F.
it_it: // F, e ArgumentTuple è la tupla di argomenti di F.

source: // Foo's signature can be either of:
it_it: // La firma di Foo può essere:

source: // For example, if F is int(bool, const string&), then Result would
it_it: // Ad esempio, se F è int(bool, const string&), allora Result sarà

source: // Generates a fatal failure and aborts the current function.
it_it: // Genera un errore fatale e interrompe [abort] la funzione corrente.

source: // Gets hold of the event listener list.
it_it: // Preleva l'elenco dei listener di eventi.

source: // Gets information about the currently running test.
it_it: // Prende le informazioni sul test attualmente in esecuzione.

source: // If `shared_resource_` is **not deleted** in `TearDownTestSuite()`,
it_it: // Se `shared_resource_` è **non deleted** in `TearDownTestSuite()`,

source: // If the constructor and destructor are not enough for setting up
it_it: // Se il costruttore e il distruttore non sono sufficienti per impostare

source: // Ignores any log not done by us.
it_it: // Ignora qualsiasi log non generato da noi.

source: // Ignores the string DoSomething() returns.
it_it: // Ignora la stringa restituita da DoSomething().

source: // Implements the mock method:
it_it: // Implementa il metodo mock:

source: // Important to use the fixture type as the return type here.
it_it: // È importante utilizzare qui il tipo di fixture come tipo restituito.

source: // In case that server's destructor will forget to delete foo,
it_it: // Nel caso in cui il distruttore di quel server si dimentichi il delete di foo,

source: // In general, you can define MatchAndExplain() as an ordinary method or
it_it: // In generale, si può definire MatchAndExplain() come un metodo ordinario oppure

source: // In this example, we want to use NotNull() with any pointer, so
it_it: // In questo esempio, vogliamo utilizzare NotNull() con qualsiasi puntatore, quindi

source: // Inside a test, access the test parameter with the GetParam() method
it_it: // All'interno di un test, si accede al parametro test con il metodo GetParam()

source: // Inside a test, refer to TypeParam to get the type parameter.
it_it: // All'interno di un test, fare riferimento a TypeParam per ottenere il parametro del tipo.

source: // Inside a test, refer to the special name TypeParam to get the type
it_it: // All'interno di un test, fare riferimento al nome speciale TypeParam per ottenere il tipo

source: // Makes sure arg0 can be converted to int.
it_it: // Si assicura che arg0 possa essere convertito in int.

source: // Makes sure param can be converted to bool.
it_it: // Si assicura che param possa essere convertito in bool.

source: // Makes sure the type of arg1 is const char*.
it_it: // Si assicura che il tipo di arg1 sia const char*.

source: // Match a value and optionally explain into an ostream. bool matched = matcher.MatchAndExplain(value, maybe_os); // where `value` is of type `T` and // `maybe_os` is of type `std::ostream*`, where it can be null if the caller // is not interested in there textual explanation.
it_it: // Match di un valore e facoltativamente lo spiega in un ostream. bool matched = matcher.MatchAndExplain(value, maybe_os); // dove `value` è di tipo `T` e // `maybe_os` è di tipo `std::ostream*`, dove può essere null se il chiamante // non è interessato alla spiegazione testuale.

source: // MatchAndExplain() accepts a pointer of any type as its first argument.
it_it: // MatchAndExplain() accetta un puntatore di qualsiasi tipo come primo argomento.

source: // Mocking a concrete method.
it_it: // Il mock di un metodo concreto.

source: // Mocking a pure method.
it_it: // Il mock di un metodo puro.

source: // Must be virtual as we'll inherit from Foo.
it_it: // Deve essere virtuale poiché erediteremo da Foo.

source: // Must be virtual as we'll inherit from StackInterface.
it_it: // Deve essere virtual poiché erediteremo da StackInterface.

source: // No action specified, meaning to use the default action.
it_it: // Nessuna azione specificata, ovvero utilizzare l'azione di default.

source: // Normal mock method definitions using gMock.
it_it: // Definizioni di metodi mock normali utilizzando gMock.

source: // Not available on Windows.
it_it: // Non disponibile su Windows.

source: // Not ideal: this could fail because of a problem with arg1 or arg2, or maybe
it_it: // Non ideale: potrebbe fallire a causa di un problema con arg1 o arg2, o forse

source: // Not virtual, but should be.
it_it: // Non virtual, ma dovrebbe esserlo.

source: // Note the comma between int and k:
it_it: // Notare la virgola tra int e k:

source: // One solution - wrap arguments that contain commas in parentheses:
it_it: // Una soluzione: racchiudere gli argomenti che contengono virgole tra parentesi:

source: // Or, an array of element matchers.
it_it: // Oppure un array di elementi di matcher.

source: // Overloaded on the const-ness of this object.
it_it: // Overloaded sul const di questo oggetto.

source: // Overloaded on the types and/or numbers of arguments.
it_it: // Overloaded sui tipi e/o numeri di argomenti.

source: // Override this to define how to set up the environment.
it_it: // Override per definire come impostare l'ambiente..

source: // Override this to define how to tear down the environment.
it_it: // Override per definire come dismettere [tear down] l'ambiente.

source: // Per-test-suite set-up.
it_it: // Configurazione "per-test-suite".

source: // Per-test-suite tear-down.
it_it: // Dismissione [tear-down] "per-test-suite".

source: // Performs the action.
it_it: // Esegue la action.

source: // Provide a friend overload.
it_it: // Si fornisce un overload friend.

source: // Put your ON_CALL(foo, ...)s here, if any.
it_it: // Se ce ne sono, mettere qui le ON_CALL(foo, ...).

source: // Resets the default action for return type std::unique_ptr<Buzz>,
it_it: // Resetta l'azione di default per il tipo restituito std::unique_ptr<Buzz>,

source: // Returns argument #0 + 5.
it_it: // Restituisce l'argomento #0 + 5.

source: // Returns the smallest prime common divisor of m and n, // or 1 when m and n are mutually prime.
it_it: // Restituisce il più piccolo divisore primo comune di m e n, // oppure 1 quando m e n sono reciprocamente primi.

source: // Returns the underlying ostream.
it_it: // Restituisce lo ostream di interesse.

source: // Returns true if and only if call_count calls will satisfy this cardinality.
it_it: // Restituisce true se e solo se le chiamate call_count soddisfano questa cardinalità.

source: // Returns true if and only if call_count calls will saturate this
it_it: // Restituisce true se e solo se le chiamate call_count satureranno

source: // Returns true if and only if the matcher matches x; also explains the match
it_it: // Restituisce true se e solo se il matcher corrisponde a x; spiega anche il risultato

source: // Returns true if m and n have no common divisors except 1.
it_it: // Restituisce true se m e n non hanno divisori comuni tranne 1.

source: // Returns true if the program exited normally with the given exit status code.
it_it: // Restituisce true se il programma è uscito normalmente con il codice di stato di uscita specificato.

source: // Sets the default action for return type std::unique_ptr<Buzz> to
it_it: // Setta l'azione di default per il tipo restituito std::unique_ptr<Buzz>

source: // Sets the default return value for type Bar.
it_it: // Imposta il valore restituito di default per il tipo Bar.

source: // Sets the default value to be returned.
it_it: // Setta il valore di default da restituire.

source: // Since we don't declare the constructor or the destructor,
it_it: // Dato che non dichiariamo né il costruttore né il distruttore,

source: // Some expensive resource shared by all tests.
it_it: // Alcune risorse costose condivise da tutti i test.

source: // Streams x to the underlying ostream; does nothing if the ostream
it_it: // Trasmette x allo ostream; non fa nulla se ostream

source: // Tests factorial of 0.
it_it: // Testa il fattoriale di 0.

source: // Tests that Foo does Abc.
it_it: // Verifica che Foo esegua Abc.

source: // The above line won't compile as Process() returns int but Abc() needs
it_it: // La riga precedente non verrà compilata poiché Process() restituisce int ma Abc()

source: // The actual behavior: the function goes on after Subroutine() returns.
it_it: // Il comportamento reale: la funzione continua al ritorno di Subroutine().

source: // The argument must be > 5 and != 10.
it_it: // L'argomento dev'essere > 5 e != 10.

source: // The cast is necessary.
it_it: // Il cast è necessario.

source: // The constructor and destructor are declared, but not defined, here.
it_it: // Il costruttore e il distruttore sono dichiarati, ma non definiti, qui.

source: // The default case.
it_it: // Il caso di default.

source: // The first argument must not contain sub-string "blah".
it_it: // Il primo argomento non deve contenere la sotto-stringa "blah".

source: // The following 2 lines will not compile due to commas in the arguments:
it_it: // Le seguenti 2 righe non verranno compilate a causa delle virgole negli argomenti:

source: // The following are expected to occur in the order declared.
it_it: // Ci si aspetta che quanto segue avvenga nell'ordine dichiarato.

source: // The following must be in the public section, even though the
it_it: // Quanto segue deve stare nella sezione public, anche se i

source: // The following won't be executed.
it_it: // Quanto segue non verrà eseguito.

source: // The more specific case.
it_it: // Il caso più specifico.

source: // The second argument must not be NULL.
it_it: // Il secondo argomento non deve essere NULL.

source: // The test will fail if a method of mock_foo other than DoThis()
it_it: // Il test fallisce se si usa un metodo di mock_foo anziché DoThis()

source: // This death test uses a compound statement.
it_it: // Questo death test usa un'istruzione composta.

source: // This must be called *before* the custom ON_CALL() statements.
it_it: // Deve essere chiamato *prima* delle istruzioni custom di ON_CALL().

source: // This test is run in the "fast" style:
it_it: // Questo test viene eseguito nello stile "fast":

source: // This test is run in the "threadsafe" style:
it_it: // Questo test viene eseguito nello stile "threadsafe":

source: // To access the test parameter, call GetParam() from class
it_it: // Per accedere al parametro test, chiamare GetParam() dalla classe

source: // To get the i-th (0-based) argument, use std::get(args).
it_it: // Per ottenere l'i-esimo argomento (basato su 0), utilizzare std::get(args).

source: // To implement a polymorphic matcher, first define a COPYABLE class
it_it: // Per implementare un matcher polimorfico, definire prima una classe COPYABLE

source: // To implement a polymorphic matcher, we just need to make MatchAndExplain a
it_it: // Per implementare un matcher polimorfico, dobbiamo solo far diventare MatchAndExplain un

source: // To refer to typedefs in the fixture, add the 'typename TestFixture::'
it_it: // Per fare riferimento a typedef nella fixture, si antepone 'typename TestFixture::'

source: // To visit static members of the fixture, add the 'TestFixture::'
it_it: // Per visitare i membri statici della fixture, si antepone 'TestFixture::'

source: // Triggers the previous EXPECT_CALL.
it_it: // Attiva la EXPECT_CALL precedente.

source: // Unsets the default return value.
it_it: // Annulla l'impostazione del valore restituito di default.

source: // Use mock_registry in code under test.
it_it: // Usare mock_registry nel codice da testare.

source: // Use the default action.
it_it: // Usa la action di default.

source: // Verifies that Foo(0), Foo(1), ..., and Foo(4) all die.
it_it: // Verifica che Foo(0), Foo(1), ..., e Foo(4) 'muoiano' tutte.

source: // Verifies that a value is divisible by 7 and the other is not.
it_it: // Verifica che un valore sia divisibile per 7 e l'altro no.

source: // Verifies that at lease one of Bar(0), Bar(1), ..., and
it_it: // Verifica che almeno uno tra Bar(0), Bar(1), ..., e

source: // We are only interested in the log severity, full file name, and
it_it: // Siamo interessati solo alla gravità nel log, il nome completo del file e

source: // We don't need to specify an action here, as the default
it_it: // Non è necessario specificare un'azione qui, poiché per noi

source: // We don't want to mock int Add(int times, Element x);
it_it: // Non vogliamo versione mock di Add(int times, Element x);

source: // When one calls ShareBuzz() on the MockBuzzer like this, the call is
it_it: // Quando si chiama ShareBuzz() su MockBuzzer in questo modo, la

source: // When this fires, the default action of MakeBuzz() will run, which
it_it: // Quando viene attivato, verrà eseguita l'azione di default di MakeBuzz(),

source: // Will execute (*f)(5.0, string("Hi")), where f is the function pointer
it_it: // Eseguirà (*f)(5.0, string("Hi")), dove f è il puntatore alla funzione

source: // Will execute callback->Run(5), where callback is the
it_it: // Eseguirà callback->Run(5), dove callback è il

source: // You can define per-test set-up logic as usual.
it_it: // È possibile definire la logica di impostazione "per-test" come al solito.

source: // You can define per-test tear-down logic as usual.
it_it: // È possibile definire la logica di dismissione "per-test" come al solito.

source: // You can do clean-up work that doesn't throw exceptions here.
it_it: // Quì si può fare un lavoro di pulizia che non generi eccezioni.

source: // You can do set-up work for each test here.
it_it: // Quì si può eseguire il lavoro di set-up per ciascun test.

source: // You can implement all the usual fixture class members here.
it_it: // Qui si possono implementare tutti i soliti membri della classe fixture.

source: // You can remove any or all of the following functions if their bodies would
it_it: // Si possono rimuovere alcune o tutte le funzioni seguenti se il loro contenuto

source: // You will need to use `this` explicitly to refer to fixture members.
it_it: // Si deve utilizzare `this` esplicitamente per fare riferimento ai membri della fixture.

source: // a method template, or even overload it.
it_it: // un metodo template, o addirittura farne un overload.

source: // after cleaning up FooTest!
it_it: // dopo aver ripulito FooTest!

source: // and cleaning up each test, you can define the following methods:
it_it: // e ripulire ciascun test, è possibile definire i seguenti metodi:

source: // are kept inside the InvokeArgument action.
it_it: // viene conservata all'interno dell'azione InvokeArgument.

source: // be empty.
it_it: // è vuoto.

source: // be int, and ArgumentTuple would be std::tuple<bool, const string&>.
it_it: // int e ArgumentTuple sarà std::tuple<bool, const string&>.

source: // before each test).
it_it: // prima di ogni test).

source: // before the destructor).
it_it: // prima del distruttore).

source: // cardinality.
it_it: // questa cardinalità.

source: // cleanup any pending stuff, but no exceptions allowed
it_it: // ripulisce qualsiasi cosa in sospeso, ma non sono consentite eccezioni

source: // code here will be called just after the test completes
it_it: // il codice qui verrà richiamato subito dopo il completamento del test

source: // code here will execute just before the test ensues
it_it: // il codice qui verrà eseguito subito prima dell'inizio del test

source: // counter than DoThis()'s.
it_it: // diversa da quello di DoThis().

source: // creating a new Buzz every time.
it_it: // per creare ogni volta un nuovo Buzz.

source: // foo.Bar() should be called twice, return 1 the first time, and return
it_it: // foo.Bar() dovrebbe essere chiamato due volte, restituire 1 la prima volta e restituire

source: // for Foo.
it_it: // per Foo.

source: // forwarded to DoShareBuzz(), which is mocked.
it_it: // chiamata viene inoltrata a DoShareBuzz(), che viene mock-ato.
